# Oefenboek op het gebruik van Pandas

Deze oefenboekjes bevatten oefeningen om te leren (leeroefeningen). We gaan er dus vanuit dat je op dit punt nog niet veel kennis hebt over de deze topic. Ze zijn bedoeld om de leerstof nog te leren begrijpen en **niet** om te testen of je de leerstof al onder de knie hebt. Daarvoor hebben we een ander soort oefeningen.

## Oefeningen op Pandas DataFrames

Maak eerst de oefenboekjes op Python en Pandas Series alvorens je hier aan begint. Importeer nu eerst de juiste libraries zodat je aan de slag kan.


```python
import pandas as pd
```

In [32]:
import numpy as np
import pandas as pd

### Oefening 1 - Werking van eenvoudige DataFrames

Een Pandas dataframe kan je aanmaken met de <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html">`DataFrame`-constructor</a>.

```python
import pandas as pd # Pandas importeren

df = pd.DataFrame(x)
```

Maak een Dataframe-object aan met de naam *data* met daarin deze Python `list` van waarden `[0.25, 0.5, 0.75, 1.0]`.

In [33]:
data = pd.DataFrame([0.25, 0.5, 0.75, 1.0])
print(data)

      0
0  0.25
1  0.50
2  0.75
3  1.00

Een dataframe is een 2D-tabel (ook als maar één kolom in de tabel zit). Je kan de dimensie opvragen met de eigenschap `.shape`. 

Een shape is een Python <a href="https://realpython.com/python-lists-tuples/#python-tuples">tuple</a>. Je tuples nog heel vaak tegenkomen.

Wat is de shape van het `DataFrame`?

In [34]:
print(data.shape)
# (4, 1)

(4, 1)

Een bepaalde kolom van een dataframe heeft altijd één bepaald datatype. Elke kolom is een Pandas `Series` of `Categorical`. 

De datatypes van een dataframe kan je opvragen met de `.dtypes`-eigenschap.

Wat zijn de datatypes van dit dataframe? Wat is het verschil met een Pandas `Series`?

In [35]:
print(data.dtypes)
# Er kan meer dan 1 datatype zijn.

0    float64
dtype: object

Zoals je nu al zou moeten weten is Pandas gebouwd bovenop Numpy-arrays en standaard Python. Achter de schermen gebruikt Pandas dus eigenlijk Numpy-arrays. Je kan deze altijd opvragen m.b.v. van volgende methode.

```python
df.to_numpy()
```
*Nota: In het Oefenboek op Numpy leer je meer over Numpy-arrays.*

Converteer het dataframe naar een Numpy array. Welke methode gebruik je hiervoor? 

Hoe verschilt de omzetting naar een Numpy array van een DataFrame met de omzetting naar Numpy array van een Series? 

*Tip: bekijk het aantal dimensies met de `shape` - eigenschap van een Numpy-array en vergelijk deze met die van een Series, bv. van `pd.Series([0.25, 0.5, 0.75, 1.0])`*

In [36]:
# 1
dataN = data.to_numpy()
print(dataN)

[[0.25]
 [0.5 ]
 [0.75]
 [1.  ]]

Bekijk de index van het DataFrame door de `.index`-eigenschap te bekijken.

In [37]:
print(data.index)

RangeIndex(start=0, stop=4, step=1)

Bekijk de kolommen van het DataFrame door de `.columns`-eigenschap te bekijken. Is er wezenlijk verschil met de index van het dataframe?

In [38]:
print(data.columns)

RangeIndex(start=0, stop=1, step=1)

Het <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html">loc</a>-commando werkt met verschillende soorten argumenten en geeft soms ook andere resultaten terug. 

Je kan één kolom of meerdere kolommen selecteren. Je kan ook hele rijen selecteren. Je kan het ook combineren waarbij je specifieke rijen uit specifieke kolommen selecteert. Je mag daarbij gebruikmaken van Python <a href="https://realpython.com/lessons/indexing-and-slicing/">`slices`</a>

Hieronder zie je enkele tips van hoe je commando kan gebruiken. Het kost enige moeite om het goed te begrijpen dus je hoeft niet te panikeren als je het niet meteen begrijpt. Indexen of slices voor de komma slaan op rijen, erna op kolommen. Heb je geen komma? Dan gaat het over kolommen.

```python
df.loc[...]
df.loc[...,...]
df.loc[[]]
df.loc[[],[]] 
``` 

Het `loc`-commando werkt op **expliciete indexen** in de dataframes (en series). Expliciete indexen zijn diegene die wij zelf definiëren en die je vindt m.b.v. `.index` en `.columns`

Haal het tweede element en het tweede t.e.m. het derde element op m.b.v. het `loc`-commando. Dit kan op heel wat verschillende manieren gerealiseerd worden.

In [39]:
# 1
print(data.loc[1,0])
# 2
print(data.loc[2:4],0)

0.5
      0
2  0.75
3  1.00 0

Het <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html">iloc</a>-commando is qua indexering zeer gelijkaardig aan het `loc`-commando, maar het werkt op **impliciete indexen**. Dit zijn een soort absolute indexen die elk dataframe heeft en die losstaan van de **uitdrukkelijke indexen** die door de data scientist gedefiniëerd zijn in `Index`-objecten en dit zijn gestockeerd in `.index` en `.columns`.

Haal het tweede element en het tweede t.e.m. het derde element op m.b.v. het `iloc`-commando. Is er *in dit geval* een verschil met het `loc`-commando qua indexwaarden? 

Waarom (niet)?

In [40]:
# 1
print(data.iloc[1,0])
# 2
print(data.iloc[2:4],0)

0.5
      0
2  0.75
3  1.00 0

### Oefening 2 - Werking van DataFrames

Maak een `Dataframe` object aan met drie rijen waavan de waarden gelijk zijn aan:

* rij 1: `['eerste', 1, 0.83, 1.3]`,
* rij 2: `['tweede', 4, 0.75, 1.0]`,
* rij 3: `['derde', 2, 4.75, 0.2]`

Gebruik hiervoor een 2D Numpy array.

Zorg ervoor dat de kolommen gelijk zijn aan `['a', 'b', 'c', 'd']`. 

Maak de index gelijk aan de getallen `[1,2]`.

In [41]:
# Data
data = np.array([
    ['eerste', 1, 0.83, 1.3],
    ['tweede', 4, 0.75, 1.0],
    ['derde', 2, 4.75, 0.2]])
# KolommenName
# df = pd.DataFrame(data, columns=['a', 'b', 'c', 'd'], index=[1, 2])
df = pd.DataFrame(data, columns=['a', 'b', 'c', 'd'])
print(df)
# In dit voorbeeld hebben we gegevens van 3 rijen en 4 kolommen, maar we proberen een dataframe-object te maken met slechts 2 indexwaarden. Dit zal leiden tot de foutmelding "Shape of passed values is (3, 4), indices imply (2, 4)".

# Om deze fout te verhelpen, moeten we ervoor zorgen dat het aantal rijen in de gegeven data overeenkomt met het aantal rijen in de gegeven index, en het aantal kolommen in de gegeven data overeenkomt met het aantal kolommen in de gegeven kolomnamen. Als alternatief kunnen we ervoor kiezen om geen index of kolomnamen op te geven, zodat pandas standaardindices en kolomnamen genereert op basis van de gegeven data.

        a  b     c    d
0  eerste  1  0.83  1.3
1  tweede  4  0.75  1.0
2   derde  2  4.75  0.2


Wat is de shape van dit `DataFrame`?

In [42]:
print(df.shape)
# (3, 4)

(3, 4)

Wat zijn de datatypes van dit dataframe? Hoeveel datatypes zijn er?

In [43]:
print(df.dtypes)

a    object
b    object
c    object
d    object
dtype: object

Wat is de output van de method `.info()` en `.describe()`?

In [44]:
# 1
print(df.index)
#
print()
# 2
print(df.describe())

RangeIndex(start=0, stop=3, step=1)

             a  b     c    d
count        3  3     3    3
unique       3  3     3    3
top     eerste  1  0.83  1.3
freq         1  1     1    1

Is er een rij-`Index` gemaakt? Zo ja, welke?

In [45]:
# Er is geen expliciete rij-index opgegeven bij het aanmaken van het DataFrame. Als er geen expliciete rij-index wordt opgegeven, maakt pandas automatisch een impliciete rij-index aan van 0 tot en met het aantal rijen minus één. In dit geval heeft de DataFrame drie rijen, dus de impliciete rij-index zou zijn: 0, 1 en 2.
# Om de impliciete rij-index te bekijken, kun je de index eigenschap van het DataFrame bekijken:
print(df.index)

RangeIndex(start=0, stop=3, step=1)

* Haal de elementen van kolom `'b'` op. Doe dit m.b.v.drie notaties:
    * met de `.`-operator
    * met de `[]`-operator
    * met twee `[]`-operatoren: `[[]]`

Bekijk telkens het type object dat je terugkrijgt met de Python type-functie.

In [46]:
# 1
print(df.b)
print(type(df.b))
#
print()
# 2
print(df['b'])
print(type(df['b']))
#
print()
# 3
print(df[['b']])
print(type(df[['b']]))
# Met de eerste twee notaties krijg je een pandas Series-object terug, terwijl je met de derde notatie een pandas DataFrame-object krijgt. In dit geval bevatten alle notaties dezelfde informatie, maar de eerste twee notaties zijn handiger als je alleen de waarden van één kolom wilt selecteren en de laatste notatie is handig als je meerdere kolommen wilt selecteren en in een DataFrame wilt plaatsen.

0    1
1    4
2    2
Name: b, dtype: object
<class 'pandas.core.series.Series'>

0    1
1    4
2    2
Name: b, dtype: object
<class 'pandas.core.series.Series'>

   b
0  1
1  4
2  2
<class 'pandas.core.frame.DataFrame'>

Haal nu de elementen van kolommen `'b'` en `'c'` op. Doe dit met:
    * de `[]` ⁻ operator
    * de `loc` - operator
    * de `iloc` - operator

In [47]:
# 1
print(df[['b','c']])
print(type(df[['b','c']]))
#
print()
# 2
print(df.loc[:,['b','c']])
print(type(df.loc[:,['b','c']]))
#
print()
# 3
print(df.iloc[:,1:3])
print(type(df.iloc[:,1:3]))

   b     c
0  1  0.83
1  4  0.75
2  2  4.75
<class 'pandas.core.frame.DataFrame'>

   b     c
0  1  0.83
1  4  0.75
2  2  4.75
<class 'pandas.core.frame.DataFrame'>

   b     c
0  1  0.83
1  4  0.75
2  2  4.75
<class 'pandas.core.frame.DataFrame'>

Haal nu enkel de 2e rij van elementen van kolommen `'b'` en 'c' op. Doe dit met:
    * de `[]` ⁻ operator
    * de `loc` - operator
    * de `iloc` - operator

In [48]:
# 1
print(df[['b','c']].iloc[1])
print(type(df[['b','c']].iloc[1]))
#
print()
# 2
print(df.loc[[1],['b','c']])
print(type(df.loc[[1],['b','c']]))
#
print()
# 3
print(df.iloc[[1],1:3])
print(type(df.iloc[[1],1:3]))

b       4
c    0.75
Name: 1, dtype: object
<class 'pandas.core.series.Series'>

   b     c
1  4  0.75
<class 'pandas.core.frame.DataFrame'>

   b     c
1  4  0.75
<class 'pandas.core.frame.DataFrame'>

Is er een Index gemaakt? Zo ja, welke?

In [49]:
# De indexwaarden van de Series zijn 'b' en 'c', maar de indexwaarde van de rij is 1.

Het datatype van de index is 'object'. Waarom is dit geen string? Zoek dit op.

In [50]:
# Het datatype van de index is 'object' omdat het een verzameling kan zijn van verschillende datatypen, inclusief strings, integers en andere datatypes. De index van een pandas DataFrame kan dus bijvoorbeeld ook bestaan uit een combinatie van verschillende datatypen.

# Het is echter wel mogelijk om een index van het datatype 'string' te maken door de dtype parameter van de Index-functie te gebruiken. Bijvoorbeeld:
test = pd.DataFrame({
    'a': [1, 2, 3],
    'b': [4, 5, 6]
}, index=pd.Index(['foo', 'bar', 'baz'], dtype='string'))

print(test)

     a  b
foo  1  4
bar  2  5
baz  3  6

### Oefening 3 - Simpele selecties uitvoeren

Maak een Pandas DataFrame genaamd **cars** m.b.v. deze internet url.

https://raw.githubusercontent.com/OCulzac/pandas-foundations/master/_datasets/auto-mpg.csv

Bestudeer dit dataframe met de methoden `.info()` en `.describe()`.

In [51]:
url = "https://raw.githubusercontent.com/OCulzac/pandas-foundations/master/_datasets/auto-mpg.csv"

# Inlezen van het bestand in een DataFrame
cars = pd.read_csv(url)
# Test DataFrame
display(cars)

,mpg,cyl,displ,hp,weight,accel,yr,origin,name
0,18.0,8,307.0,130,3504,12.0,70,US,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,US,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,US,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,US,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,US,ford torino
...,...,...,...,...,...,...,...,...,...
387,27.0,4,140.0,86,2790,15.6,82,US,ford mustang gl
388,44.0,4,97.0,52,2130,24.6,82,Europe,vw pickup
389,32.0,4,135.0,84,2295,11.6,82,US,dodge rampage
390,28.0,4,120.0,79,2625,18.6,82,US,ford ranger
391,31.0,4,119.0,82,2720,19.4,82,US,chevy s-10

In [52]:
print(cars.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 392 entries, 0 to 391
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     392 non-null    float64
 1   cyl     392 non-null    int64
 2   displ   392 non-null    float64
 3   hp      392 non-null    int64
 4   weight  392 non-null    int64
 5   accel   392 non-null    float64
 6   yr      392 non-null    int64
 7   origin  392 non-null    object
 8   name    392 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 27.7+ KB
None

In [53]:
display(cars.describe())

,mpg,cyl,displ,hp,weight,accel,yr
count,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000,392.000000
mean,23.445918,5.471939,194.411990,104.469388,2977.584184,15.541327,75.979592
std,7.805007,1.705783,104.644004,38.491160,849.402560,2.758864,3.683737
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.000000,4.000000,105.000000,75.000000,2225.250000,13.775000,73.000000
50%,22.750000,4.000000,151.000000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,275.750000,126.000000,3614.750000,17.025000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

Selecteer nu alle auto's die een **mpg** waarde groter dan 40 hebben. Dit kan je doen door dit commando toe te passen:

```python
df[df.kolom > waarde]
```

Hoeveel auto's vind je?

In [54]:
display(cars[cars.mpg > 40])

,mpg,cyl,displ,hp,weight,accel,yr,origin,name
242,43.1,4,90.0,48,1985,21.5,78,Europe,volkswagen rabbit custom diesel
307,41.5,4,98.0,76,2144,14.7,80,Europe,vw rabbit
320,46.6,4,86.0,65,2110,17.9,80,Asia,mazda glc
322,40.8,4,85.0,65,2110,19.2,80,Asia,datsun 210
323,44.3,4,90.0,48,2085,21.7,80,Europe,vw rabbit c (diesel)
324,43.4,4,90.0,48,2335,23.7,80,Europe,vw dasher (diesel)
327,44.6,4,91.0,67,1850,13.8,80,Asia,honda civic 1500 gl
388,44.0,4,97.0,52,2130,24.6,82,Europe,vw pickup

Als je meerdere eigenschappen wil gebruiken om op te filteren, moet je ze combineren met logische operatoren (&, |) en de condities tussen haakjes zetten. 

Je kan de condities ook in aparte variabelen stoppen en die gebruiken om te filteren.

```python
df[(df.kolom1 > waarde1) & (df.kolom2 < waarde2)]

cond1 = df.kolom1 > waarde1
cond2 = df.kolom2 < waarde2

df[cond1 & cond2]
```
Selecteer nu alle auto's die een **mpg** waarde groter hebben dan 40 en die uit **Europe** komen.

In [55]:
display(cars[(cars.mpg > 40) & (cars.origin == 'Europe')])

,mpg,cyl,displ,hp,weight,accel,yr,origin,name
242,43.1,4,90.0,48,1985,21.5,78,Europe,volkswagen rabbit custom diesel
307,41.5,4,98.0,76,2144,14.7,80,Europe,vw rabbit
323,44.3,4,90.0,48,2085,21.7,80,Europe,vw rabbit c (diesel)
324,43.4,4,90.0,48,2335,23.7,80,Europe,vw dasher (diesel)
388,44.0,4,97.0,52,2130,24.6,82,Europe,vw pickup

Je kan de waarden in dataframe ook sorteren. Daarvoor gebruik je de <code>sort_values</code> functie.

```python
df.sort_values('kolom')
df.sort_values('kolom', ascending = False)

df.sort_values(['kolom1','kolom2'], ascending = [False, True])
```

Sorteer de auto's op **hp** van groot naar klein en tegerlijktijd op **accel** van klein naar groot. Auto nummer 115 zou bovenaan moeten komen te staan.

In [56]:
display(cars.sort_values('hp', ascending=False))

,mpg,cyl,displ,hp,weight,accel,yr,origin,name
115,16.0,8,400.0,230,4278,9.5,73,US,pontiac grand prix
94,12.0,8,455.0,225,4951,11.0,73,US,buick electra 225 custom
13,14.0,8,455.0,225,3086,10.0,70,US,buick estate wagon (sw)
8,14.0,8,455.0,225,4425,10.0,70,US,pontiac catalina
6,14.0,8,454.0,220,4354,9.0,70,US,chevrolet impala
...,...,...,...,...,...,...,...,...,...
242,43.1,4,90.0,48,1985,21.5,78,Europe,volkswagen rabbit custom diesel
324,43.4,4,90.0,48,2335,23.7,80,Europe,vw dasher (diesel)
323,44.3,4,90.0,48,2085,21.7,80,Europe,vw rabbit c (diesel)
101,26.0,4,97.0,46,1950,21.0,73,Europe,volkswagen super beetle
19,26.0,4,97.0,46,1835,20.5,70,Europe,volkswagen 1131 deluxe sedan

Selecteer nu alle auto die in Europe en de US zijn gemaakt. Hiervoor ga je gebruikmaken van een nieuwe methode: `.isin()`.



```python
# df.kolomnaam.isin(lijst van waarden)
```
Probeer dit uit op `origin` kolom en met de waarden `['Europe','US']` en sla dit resultaat op in een variabele `europe_us_cars`.

Tip: *je kan deze uitdrukking ook negeren door er een tilde (~) voor te plaatsen.*

Welk resultaat krijg je en wat is het type van dit resultaat? (`type()`)

In [57]:
europe_us_cars = cars.origin.isin(['Europe','US'])
print(type(europe_us_cars))

<class 'pandas.core.series.Series'>

Gebruik de `europe_us_cars`-variabele in combinatie met het originele dataframe `cars` om alleen de auto's te selecteren die uit Europe of de US komen. Je kan dit doen met de haakjes `[]` of met de `.loc`-methode (, en zelfs de `.iloc`-methode, maar dat is hier minder gepast).

In [58]:
display(cars[europe_us_cars])

,mpg,cyl,displ,hp,weight,accel,yr,origin,name
0,18.0,8,307.0,130,3504,12.0,70,US,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,US,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,US,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,US,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,US,ford torino
...,...,...,...,...,...,...,...,...,...
387,27.0,4,140.0,86,2790,15.6,82,US,ford mustang gl
388,44.0,4,97.0,52,2130,24.6,82,Europe,vw pickup
389,32.0,4,135.0,84,2295,11.6,82,US,dodge rampage
390,28.0,4,120.0,79,2625,18.6,82,US,ford ranger
391,31.0,4,119.0,82,2720,19.4,82,US,chevy s-10

Combineer nu de vorige oefening door enkel de cyl en de weight te selecteren van de Europe en US-auto's. Hiervoor kan je enkel gebruikmaken van de `.loc`-operator.

In [59]:
display(cars.loc[:,['cyl', 'weight']])

     cyl  weight
0      8    3504
1      8    3693
2      8    3436
3      8    3433
4      8    3449
..   ...     ...
387    4    2790
388    4    2130
389    4    2295
390    4    2625
391    4    2720

[392 rows x 2 columns]

We gaan nu het gemiddelde gewicht van Amerikaanse auto's (US) vergelijken het gemiddelde gewicht van Aziatische auto's. We moeten eerst weten welke waarde de kolom `origin` allemaal kan aannemen.

We selecteren die kolom en passen de `.unique()`-methode toe. Probeer dit hieronder uit. Welke waarde heeft `origin` voor Aziatische auto's?

In [60]:
display(cars['origin'].unique())

array(['US', 'Asia', 'Europe'], dtype=object)

Op een Pandas Series kan je een aantal statistiche methoden uitvoeren (zie ook verder). Het gemiddelde van een bepaalde selectie kun je laten berekenen met de `.mean()`-methode.

Zoek het gemiddelde gewicht van Aziatische auto's en dat van Amerikaanse auto's. Ben je verrast over het resultaat?

In les 3 zullen we nieuwe commando's leren waarmee we dit resultaat zullen kunnen bekomen.

In [61]:
gewichtAS = pd.Series(cars[cars['origin'] == 'Asia'].weight)
gewichtUS = pd.Series(cars[cars['origin'] == 'US'].weight)
print('Gemiddelde gewicht Asia      ->  ' + str(round(gewichtAS.mean(),2)))
print('Gemiddelde gewicht US        ->  ' + str(round(gewichtUS.mean(),2)))

Gemiddelde gewicht Asia      ->  2221.23
Gemiddelde gewicht US        ->  3372.49

### Oefening 4 - Dataframe aanpassen

Maak een Pandas DataFrame genaamd **titanic** m.b.v. deze internet url.

https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/fa71405126017e6a37bea592440b4bee94bf7b9e/titanic.csv

Bestudeer dit dataframe met `.info()`, `.describe()`, `.head()`, en `.tail()`. Aan de laatste methoden kan je ook een parameter meegeven om de hoeveelheid te tonen rijen te bepalen.

In [62]:
url = "train.csv"

# Inlezen van het bestand in een DataFrame
titanic = pd.read_csv(url)
# Test DataFrame
display(titanic)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [63]:
display(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

None

In [64]:
display(titanic.describe())

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [65]:
display(titanic.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [66]:
display(titanic.tail())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

Met welk commando kan je alleen kolom `Embarked` bekijken? 

Combineer dit met de `.head()`-methode. Je zou een Pandas `Series` moeten krijgen die  S, C en Q's bevat.

In [67]:
# De URL, die In het begin van deze oefening is gegeven, is niet meer beschikbaar. -> "HTTPError: HTTP Error 404: Not Found"
embarked = titanic['Embarked']
print(embarked.head())
# Dit zou de eerste vijf waarden van de kolom 'Embarked' tonen. Je kan ook het volgende commando gebruiken om alleen de kolom 'Embarked' te tonen:
print(titanic['Embarked'].head())

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object
0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object

Kolom `Embarked` staat voor *Port of Embarkation* met (C = Cherbourg; Q = Queenstown; S = Southampton).

Schrijf eerst een commando om alleen de rijen over te houden waarin het vertrek C(herbourg) is. Herhaal dit voor de andere 2 havens. Met de `.loc`-methoden kan je makkelijk realiseren (het gaat ook met de vierkante haakjes).

In [68]:
# De URL, die In het begin van deze oefening is gegeven, is niet meer beschikbaar. -> "HTTPError: HTTP Error 404: Not Found"
titanic_c = titanic.loc[titanic['Embarked'] == 'C']
titanic_q = titanic.loc[titanic['Embarked'] == 'Q']
titanic_s = titanic.loc[titanic['Embarked'] == 'S']
# of
# titanic_c = titanic[titanic['Embarked'] == 'C']
# titanic_q = titanic[titanic['Embarked'] == 'Q']
# titanic_s = titanic[titanic['Embarked'] == 'S']

Schrijf nu een Python `for`-loop waarmee je over een lijst van waarde `['C','Q','S']` itereert zodat je binnen de `for`-loop telkens die rijen van het dataframe selecteert die overeenstemmen met de `Embarked`-waarde uit de lijst. Voor elk van de havens print je het aantal rijen uit door op de selectie (een subdataframe dus) de `.size`-eigenschap op te roepen.

Dus zoiets ongeveer:
```python
# for haven in ['C','Q','S']:
 # selecteer alle rijen die gelijk zijn de waarde 'haven'.
 # print het aantal rijen uit met de .size - eigenschap in een duidelijke boodschap
```

Nota: een eigenschap is geen methode en daarom hoef je ook geen ronde haakjes te plaatsen achter `.size`.  Je zou dit resultaat moeten bekomen.

```
Vanuit C vertrokken 2016 personen
Vanuit Q vertrokken 924 personen
Vanuit S vertrokken 7728 personen
```

In [69]:
# De URL, die In het begin van deze oefening is gegeven, is niet meer beschikbaar. -> "HTTPError: HTTP Error 404: Not Found"
for haven in ['C','Q','S']:
    subdataframe = titanic.loc[titanic['Embarked'] == haven]
    print(f"Vanuit {haven} vertrokken {subdataframe.size} personen")

Vanuit C vertrokken 2016 personen
Vanuit Q vertrokken 924 personen
Vanuit S vertrokken 7728 personen

Een waarde in een dataframe vervangen kan m.b.v. het toekenningsstatement (`=`).

```
df.kolom_naam = nieuwe_waarde
```

Je kan dit ook combineren met een selectie op bepaalde rijen zoals je hierboven reeds toepaste.

We willen de afkortingen van de havens vervangen door de volledige namen van havens van vertrek. Zoals steeds kan dit op verschillende manieren en in dit oefenboek bekijken we dan enkele mogelijke oplossingen. 

Gebruik de `.loc`-eigenschap om eerst alleen de kolom `Embarked` te selecteren met de waarde gelijk aan 'C'. Je moet hiervoor een komma gebruiken binnen de haakjes van `.loc` (`.loc[ , ]`). Probeer vervolgens de nieuwe waarde 'Cherbourg' toe te kennen aan de geselecteerde gegevens.

*Let op: als je fout maakt, moet je het originele dataframe herladen met de eerste stap. Veiliger is om eerst een kopie te maken en daarop te proberen. Je kan een kopie `titanic2` maken met de `.copy()`-methode of met een toekenning aan een nieuwe variabele*

*Let nog meer op: als je het fout aanpakt ga je een SettingWithCopyWarning krijgen. Die waarschuwing kan je best al proberen te begrijpen door dit lezen: https://www.dataquest.io/blog/settingwithcopywarning/*

In [70]:
# De URL, die In het begin van deze oefening is gegeven, is niet meer beschikbaar. -> "HTTPError: HTTP Error 404: Not Found"

titanic2 = titanic.copy() # Maak een kopie van het dataframe

# Vervang de afkortingen in de kolom Embarked door de volledige namen van de havens
titanic2.loc[titanic2['Embarked'] == 'C', 'Embarked'] = 'Cherbourg'
titanic2.loc[titanic2['Embarked'] == 'Q', 'Embarked'] = 'Queenstown'
titanic2.loc[titanic2['Embarked'] == 'S', 'Embarked'] = 'Southampton'

Als je zeker bent dat je commando's gewerkt hebben op de kopie van onze titanic dataset kunnen we nu alle wijzigingen in één keer doorvoeren m.b.v. een for-loop.

```python
# for afkorting, haven in [('C', 'Cherbourg'), ('Q', 'Queenstown'), ('S','Southampton')]:
  # selecteer de juiste rijen en vervang daarin de afkorting door de volledige naam
```

Met bovenstaande code doorloop je een lijst van tuples. Per iteratie haal je twee gegevens op: de afkorting en de naam van de haven.

In [71]:
# De URL, die In het begin van deze oefening is gegeven, is niet meer beschikbaar. -> "HTTPError: HTTP Error 404: Not Found"

for afkorting, haven in [('C', 'Cherbourg'), ('Q', 'Queenstown'), ('S','Southampton')]:
    titanic.loc[titanic['Embarked'] == afkorting, 'Embarked'] = haven